body = {
    '1' : ['🔹Футболка из кожи', 4, 0],
    '2' : ['🔹Нагрудник из серебра', 15, 0],
    '3' : ['🔷Нагрудник рыцаря', 16, 1],
    '4' : ['🔷Железный нагрудник', 20, 2]
}

legs = {
    '1' : ['🔹Кожаные ботинки', 2, 0],
    '2' : ['🔹Серебрянные сапоги', 5, 0],
    '3' : ['🔷Ботинки рыцаря', 7, 1],
    '4' : ['🔷Подкованные железом ботинки', 10, 2]
}

head = {
    '1' : ['🔹Кожанная обвязка', 2, 0],
    '2' : ['🔹Серебрянный шлем', 7, 0],
    '3' : ['🔷Шлем рыцаря', 7, 1],
    '4' : ['🔷Железный шлем', 10, 2]
}

mask = {
    '1' : ['🔹Кожаная маска', 2, 0],
    '2' : ['🔹Серебрянная маска', 5, 0],
    '3' : ['🔷Маска рыцаря', 6, 1],
    '4' : ['🔷Железная маска', 7, 2]
}

gun = {
    'ban': ['🔨Банхаммер', 0, 0],
    '1': ['🔸Алюминиевый меч', 0, 10],
    '2': ['🔸Алюминиевый топор', 0, 10],
    '3': ['🔸Медный меч', 0, 25],
    '4': ['🔸Медный топор', 0, 25],
    '0': ['🔸Ножка стола', 0, 5],
    '5': ['🔶Меч рыцаря', 0, 30],
    '6': ['🔶Железный меч', 0, 35]
}

shand = {
    'test': ['Тестовая рука', 1, 1],
    'knife': ['🔸Кухонный нож', 0, 3],
    'shield': ['🔸Кухонная доска', 3, 0]
}

amulet = {
    'test': ['Тестовый амулет'],
    'collector': ['Амулет Сборщика'],
    'insight': ['Амулет Зоркости'],
    'otorhin': ['Амулет Отортика'],
    'hunter': ['Амулет Охотника']
}


#name, atk, def, hp, time, vamp
potion = {
    '1': ['Бодрящий напиток', 0, 0, 50, 30, 0],
    '2': ['Слабое зелье берсерка', 10, -5, 0, 30, 0],
    '3': ['Костерост', 0, 10, 0, 30, 0],
    '4': ['Зелье Вампира', 0, 0, 0, 30, 5]
}