item = {
    'stick' : 'Ветка',
    'coal' : 'Уголь',
    'iron' : 'Железо',
    'stone' : 'Камень',
    'thread':'Веревка',
    'bone':'Кость',
    'ruby':'Рубин',
    'stick2': 'Палка',
    'wolfberri': 'Волчья ягода',
    'blueberri' : 'Голубика',
    'hallucberri': 'Галюциногенные грибы',
    'oldacorn': 'Старый желудь',
    'wildhops': 'Дикий хмель',
    'chairleg': 'Ножка стола',
    'invigor': 'Бодрящий напиток',
    'weakpotionber': 'Слабое зелье Берсерка',
    'babydoll': 'Детская кукла',
    'snowflower': 'Снежноцвет',
    'blacksmithtools': 'Инструменты кузнеца',
    'lost_cargo': 'Потерянный груз',
    'logic': 'Логика',
    'leather': 'Кожа'
}


list_item = {
    'forest': [ ['stick', 'thread', 'wolfberri', 'oldacorn'], ['stone', 'bone', 'blueberri', 'wildhops'], ['hallucberri'], ['hallucberri'] ],
    'mount': [ ['stone'], ['coal'], ['iron'], ['ruby'] ]
}


buff = {
    'adventure': 'Быстрые приключения',
    'atk': 'Зелье силы',
    'def': 'Зелье защиты',
    'bar': 'Опьянение',
    'milk': 'Молочко',
    'potion': 'Зелье',
    'pidr': 'Баф на то что ты пидр'
}


ach_name = {
    'start' : '🐣Осилил нажать /start',
    'beta' : '🥽Вроде околотоп',
    'betaexp' : '💡Опытный игрок',
    'betagold' : '💰Порванные карманы от золота',
    'betarating' : '🏆Любитель красного меча',
    'chatevent' : '💭Игрок букв в чате',
    'chatproeb' : '🌬Ярик, бочок потик',
    'chatwin' : '🍌Азино три топора',
    '1gold' : '💩Пронесло',
    'donat': '🏵Любимчик разрабов',
    'expect': '☠️Дождался'
}


adventure_name = {
    'forest' : 'Лес',
    'mount' : 'Горы',
    'desert' : 'Пустыня',
    'tavern' : 'Бар Таверны',
    'guild' : 'Гильдия'
}


adv_text = {
    'forest': '🌲Ты ушел прогулятся по лесу. Надеюсь, что выйдешь оттуда не с пустыми руками.',
    'mount': '🗻Ты ушел прогуляться по горам. Надеюсь, что выйдешь оттуда не с пустыми руками.',
    'desert': '🏜Ты ушел прогуляться под палящим солнцем пустыни. Надеюсь, что выйдешь оттуда не с пустыми руками.'
}

advent_text = {
    'forest': ['Ты замечаешь дупло в одном из деревьев. Не хочется тыкнуть /catch и сунуть туда руку?', 'Старый, дряхлый пень... В таком можно легко что-то спрятать, а значит - и найти! /catch!', 'Ты остановился из-за поваленного на тропу дерева. Кто знает, что можно найти в нём? Можно проверить путём тыка /catch, а можно обойти и пойти дальше.', 'Произошёл обвал, под который ты чуть было не попал. Стоит проверить эту груду упавших камней, в ней наверняка можно найти что-то полезное. /catch', 'Местные боятся заходить в эту хижину, хотя она уже давным-давно заброшена. Зайдёшь и проверишь что там, ведь ресурсы важнее или пройдёшь мимо? /catch', 'Кем-то покинутая в спешке палатка. Стоит проверить. /catch', 'Огромный кострище расположился прямо посреди поляны. Так вот что за столб дыма ты заметил в лесу, когда выходил из таверны... Того, кто его развёл нигде нет, можно и немного покопаться в его вещичках. /catch', 'Случайно провалился в чью-то землянку. Стоит уходить, пока хозяина нет дома. А может... /catch?', 'Мимо тебя на большой скорости промчалась повозка, из которой выпал мешок с чем-то. Проверим находку? /catch', 'Чёрт, ты провалился в яму и, кажется, не случайно - это была чья-то ловушка. На дне лежит череп и какая-то вещица. Забирай (не череп!) или выбирайся поскорее. /catch', 'Кристально чистый ручеёк, иногда даже замечаешь быстро проплывающих мальков. На дне лежит что-то тяжелое. /catch', 'Нашёл ловушку, в которую попался кролик. Тебе стало жалко и ты отпустил его. Однако с остальным, что было в ловушке тоже нужно что-то делать... /catch', 'Случайно набрёл на лисиную нору. Пока не было мамки, зачем-то распугал лисят. Так же в норе было ещё кое-что... /catch'],
    'mount': ['Недавний обвал открыл новую долину. Нажми /catch чтобы обыскать её.', 'С перевала заметна глубока пещера, /catch чтобы осмотреть её.', 'Гравий под ногами осыпается, открывая провал в пещеру. Прыгни, используя /catch.', 'Возле горной реки всегда есть что-то интересное, /catch поможет в поисках.', 'Ледяной водопад может скрывать ресурсы, /catch чтобы нырнуть и не замёрзнуть насмерть.', 'В соседней долине нашелся очень густой лес. /catch чтобы узнать, что он скрывает.', 'Камнепад прошёл с верхнего яруса долины. Возможно, с /catch под завалами найдётся что-нибудь полезное?'],
    'desert': ['Опять мираж! Или всё же нет? Вот чёрт, кажется кто-то надвигается!\n/catch', 'Пробираясь по пустыне, внезапно поднялась песчаная буря! Ты не заметил, как в буре к тебе кто-то подобрался! /catch !', 'В этих песчанных скалах можно хорошо отдохнуть... Но кажется там кто-то уже прячется. /catch чтобы разобратся!', 'В песках какое-то движение. Замри на месте, или /catch чтобы бесстрашно пойти вперёд!', 'Тень вдалеке выглядит подозрительно. Монстр? Мираж? /catch чтобы выяснить!'],
    'item': ['Ого, *{}*! Пригодится.', '*{}* обязательно пригодится в хозяйстве.', 'Внутри что-то лежало. Это же *{}*!', 'И зачем мне *{}*? Ну ладно, вдруг понадобится.', 'Кажется, это *{}*. Повезло.', '*{}* отправляется в рюкзак, а ты продолжаешь своё путешествие.', 'А вот и *{}*, наконец-то нашёл.', 'Это что там лежит, *{}*? Отлично!'],
    'diamond_item': ['Ого, *{}*! И ещё 1 алмаз, повезло.', 'Ты обнаружил *{}*, а также 1 алмаз, после этой замечательной находки ты продолжил свой путь'],
    'not_item': ['Слишком поздно.', 'Кажется ты уже упустил эту возможность.', 'В следующий раз думай быстрее.', 'Событие не актуально, слишком поздно']
}

bar_text = {
    'milk': ['🍼*звуки отсоса молока*', '🍼На, держи сосунок.', '🍼Вот тебе молочко маленький и в подарок, бонусом конфетка🍭', '🍼Настоящие молоко, для настоящих сосунков.', '🍼Твоё молоко, и подарок от заведения 🍭'],
    'tincture': ['🥃Настойка? Хороший выбор.', '🥃Вот тебе стакан и не вздумай сражатся, после того как осушишь его.', '🥃Та-дам, а вот и твоя настойка.', '🥃Ты выпил залпом целый стакан, и подумал может тебе самому начать продавать такой-же, а как-же его тогда назвать? Думаю "Джек Данилунс" подойдёт.'],
    'el': ['🍺Твоя кружка, воин.', '🍺Ты выпил целую кружку, за пару секунд.', '🍺Твоя кружка, войн или не воин. На бери и всё.', '🍺Целая кружка специально для тебя.', '🍺Не целая кружка специально для тебя.'],
    'mead': ['🍯Выпив медовухи ты нечего не почувствовал, будто хлебнул воды, кажется в пустую потратил деньги.', '🍯Эй бармен, это точно медовуха, а не мёд?\nИбо слишком она сладкая, я что не мужик что сладости жру?','🍯Почему столько сахара? Бармен подайка мне чили🌶.\nСмешиваем 🍯+🌶=мм мм, хорошо пошло.']
}

rules = """
⚠️Правила:

Запрещено:
1. Скрипты, автоматизация, боты
2. Накрутка игровых ресурсов
3. Использование багов

Поддержка бота - @unknown_inbot
"""


quests_example = {
    'start_0': {
    'text' : 'Хозяин смотрит как ты подходишь к доске заданий, и мягко останавливает тебя.\n-Мужик, не пойми неправильно, но новичков мы на задания не отправляем. Такое заслужить надо. Сходи например в лес, набери хвороста для таверны. Не заблудишься - тогда и посмотрим. Конечно, я оплачу.',
    'type' : 'item',
    'item' : 'stick',
    'need' : 5
    }, 'start_4': {
    'text' : '-А? Чего? Мужик, у меня нет времени с тобой болтать, ты видишь сколько посетителей? Чего? Задания? Хочешь быть полезным, иди в подвал, вон дверь слева по коридору, найдёшь там мою помощницу, скажешь что я послал тебя помочь с готовкой напитков.',
    'type' : 'potion',
    'item' : '1',
    'need' : 1
    }, 'start_5': {
    'text' : '-Чтоб их, пьянчуг мелких... Ты как раз вовремя. После той попойки твой Бодрящий Напиток пользовался спросом. Ты знал, что он еще и снимает похмелье? Но ближе к делу. Тут произошла небольшая драка, и я не успел вовремя разнять этих га... кхм, посетителей. Никто не пострадал, но они успели сломать стол, за которым вообще-то сидели! Не смотри на меня такими глазами, я не прошу тебя собрать мне тут целый стол, ты ж не "Икея" как при королевском замке. Но если ты сможешь сделать замену для сломанной ножки - ты меня выручишь.',
    'type' : 'gun',
    'item' : '0',
    'need' : 1
    }, 'usual_5': {
    'text' : '-Что-то, скучно у меня таверна обставлена... Не хватает ей какой-нибудь изюминки. А что сделать - незнаю, хоть вешайся... О, точно! Хочу голову какой-нибудь горной твари на стену повесить. Да позубастее. Говорят, в горах иногда видят Виверн - не мог бы ты... Это... Достать мне пару голов? По-дружески. Не без оплаты конечно!',
    'type' : 'monster',
    'monster' : 'poitwiw',
    'need' : 2
    }
}


quests = {
    'start_0': {
        'text' : 'Хозяин смотрит как ты подходишь к доске заданий, и мягко останавливает тебя.\n`-Мужик, не пойми неправильно, но новичков мы на задания не отправляем. Такое заслужить надо. Сходи например в лес. Не заблудишься - тогда и посмотрим.`',
        'type' : 'adventure',
        'adventure' : 'forest',
        'need' : 1
    }, 'start_1': {
        'text' : '`-О, вернулся! И ста лет не прошло, хе-хе. Раз уж ты так хочешь, не поможешь мне? Сходи еще разок в лес, принести хворосту. А то у нас как раз кончается дерево на кухне… Я заплачу, конечно.`',
        'type' : 'item',
        'item' : 'stick',
        'need' : 5
    }, 'start_2' : {
        'text': '`Многие думают что я шучу, когда прошу принести хворосту, а мне ведь надо чем-то камин в таверне топить, верно? Я бы с тобой выпил за твоё возвращение, но гляди ж ты... У меня бочёнки с пивом подходят к концу, того и гляди завтра закончатся. А продавать ту дрянь, которую в соседних тавернах называют пивом - не хочу. Сходи-ка ты в лес, набери мне там Хмеля, а? Дикий-то хмель, лесной - он особый! Разумеется, оплата будет стоить того.`',
        'type' : 'item',
        'item' : 'wildhops',
        'need' : 5
    }, 'start_3': {
        'text' : '`-Знаешь, моё Лесное Пиво имеет успех у приключенцев! Несмотря на то что это всё еще пиво, небольшой запах леса - это то чего ему всегда не хватало, точно тебе говорю! Но есть у меня одна идея... В здешнем лесу есть дубы - такого размера, что и несколько человек обхватить не смогут. И желуди у таких дубов соответствующие. А я как представлю себе шляпку от такого желудя, так сразу понимаю - насадить её на тонкую палочку, да в пиво опустить, выйдет штука похожая на заморский "зонтик", а уж какой запах! В общем, принеси мне несколько желудей, лады?`',
        'type' : 'item',
        'item' : 'oldacorn',
        'need' : 7
    }, 'start_4': {
        'text' : '`-Опять к доске идёшь? Не, ты всё еще хлюпик. Иди лучше сюда, послушай.  Ты вкурсе, что четыре столицы главных государств сейчас находятся в войне? Никто точно незнает, но поговаривают, что это из-за пророчества, мол, только сильнейшее из мировых государств сможет победить "Великое зло" которое грядет. Или что-то такое. Но это я к чему - нехватка рабочих рук, вот это настоящее зло! Мне срочно нужно чтобы ты принёс мне камней. Желательно - гладких и овальных, хорошо? И побыстрее, гости хотят посетить новую баню, а я забыл заказать подходящие камни!`',
        'type' : 'item',
        'item' : 'stone', 
        'need' : 10
    }, 'start_5': {
        'text' : '`-А? Чего? Мужик, у меня нет времени с тобой болтать, ты видишь сколько посетителей? Чего? Задания? Хочешь быть полезным, иди в подвал, вон дверь слева по коридору, найдёшь там мою помощницу, скажешь что я послал тебя помочь с готовкой напитков.`',
        'type' : 'potion',
        'item' : '1',
        'need' : 1
    }, 'start_6': {
        'text' : '`-Чтоб их, пьянчуг мелких... Ты как раз вовремя. После той попойки твой Бодрящий Напиток пользовался спросом. Ты знал, что он еще и снимает похмелье? Но ближе к делу. Тут произошла небольшая драка, и я не успел вовремя разнять этих га... кхм, посетителей. Никто не пострадал, но они успели сломать стол, за которым вообще-то сидели! Не смотри на меня такими глазами, я не прошу тебя собрать мне тут целый стол, ты ж не "Икея" как при королевском замке. Но если ты сможешь сделать замену для сломанной ножки - ты меня выручишь.`',
        'type' : 'gun',
        'item' : '0',
        'need' : 1
    }, 'start_7': {
        'text' : '`-Эти сборщики налогов когда-нибудь меня разорят, чесное слово. Сначала разорили все до единой старые гильдии, теперь взялись за таверны? Староват я стал для таких споров... А знаешь, есть у меня одна идея, что с ними делать. Можешь сходить в лес, и набрать там... э... грибов? Знаешь, беленькие такие, с фиолетовыми точечками. Только постарайся не трогать их голыми руками, ладно? Так они станут гораздо сговорчивее. И да... я надеюсь, это останется между нами.`',
        'type' : 'item',
        'item' : 'hallucberri',
        'need' : 2
    }, 'start_8': {
        'text' : '`-Хэй, помнишь ты помогал мне с таверной? Ты готовить умеешь? Э... Ладно, а просто приготовить хоть что-то, не отравив никого? Как ты вообще в путешествия ходишь, а? Ладно, как минимум ты наблюдательный и собирать полезные ресурсы уж точно умеешь. У нас кончаются ягоды для пирожков, так что возьми на кухне лукошко и беги в лес.`',
        'type' : 'item',
        'item' : 'blueberri',
        'need' : 5
    }, 'start_9': {
        'text' : '`- Ухх... Что-то мне сегодня не здоровится. Знаешь, бывают такие дни. Голова кружится, ноги ватные... И не думай мне тут говорить что это потому что я старик!!! Я могу еще.. Ой... Кх... Это... Слушай... Есть одно хорошее зелье. Буду очень рад если ты мне его принесёшь. Вообще, оно зовётся "Зелье Берсерка", но помогает как ничто другое. Оплачу все затраты, и даже сверху.`',
        'type' : 'potion',
        'item' : '2',
        'need' : 1
    }, 'start_10': {
        'text' : '`-И тебе доброго времени, ага. Что, на доску смотришь? Хех. Помнишь мы с тобой говорили на счет того, что из-за сборщиков налогов я скоро разорюсь? С ними я... э... договорился, но есть еще кое-что. Тут полно пьяниц, которые пить хотят, а платить или работать - не очень. И они повадились сбегать от оплаты. Я уже троих подметил, и вот думаю - надо бы их проучить. Тебе же нравится по лесу гулять, да? Набери мне Волчьих Ягод, и я в долгу не останусь.`',
        'type' : 'item',
        'item' : 'wolfberri',
        'need' : 3
    }, 'start_11': {
        'text' : '`-Да-да, мужик, не ругайся. Всё помню. Обещал. Но Святой Лианитий мой свидетель - работы было огромное количество, не до этого было. Да ты и сам видел.\nВ общем, давай так - сходи в горы. Незнаю, замечал ты их за лесом или нет, но они там. Говорят, оттуда лезут хилые монстры, но их довольно много. Так что думаю, если ты будешь аккуратен, всё пройдет отлично, и я поверю что ты можешь пользоваться оружием так, что не пришибёшь сам себя. И тогда я сможешь брать задания с доски сколько угодно, я и слова не скажу. `',
        'type' : 'monster',
        'monster' : 'wolf',
        'need' : 2
    }, 'start_12': {
        'text' : '`-Гляжу тебе нравятся задания? Хе, ты только погляди - моя таверна расцветает! Вот только, тревожно это всё… Людей с каждым днём всё больше, да только денег у них – грош. И все как один говорят, что приехали с севера. С северной границы, то есть. А значит совсем с войной у нас не ладится. Но люди пока еще совсем нервные, слово сказать боятся… Ты не мог бы, это… Сесть, выпить немного, да попробовать их разговорить? На своём опыте знаю, хорошему собутыльнику люди и жизнь могут доверить.`',
        'type' : 'adventure',
        'adventure' : 'tavern',
        'need' : 1
    }, 'start_13': {
        'text' : '`-Эвоно как… Если северная граница пала, значит и до нас скоро доберутся, помяни моё слово. Да и дальше… На севере считай, наша сильнейшая армия была. Но я-то таверну не брошу! Да и если ты остаёшься, то мне нечего боятся, а?  Но конечно, я только спасибо тебе скажу, если ты сможешь достать мне что-нибудь колюще-режущее. Так мне будет по-спокойнее…`',
        'type' : 'gun',
        'item' : '3',
        'need' : 1
    }, 'start_14': {
        'text' : '`-Спасибо за тот меч, с ним я себя как-то увереннее чувствую. Но у меня тут новая напасть. Видишь мужика в углу? Весь в сером, с медалькой? Это вербовщик. Считай, стоит к нему сесть – и ты в рядах новобранцев идёшь на верную смерть к северной границе. Гадко это, только вот я и сам не знаю, как по-другому сейчас действовать. Знаешь, я поговорю с одним человеком… На счёт помощи. Не то чтобы я много могу, но может, если сведу вас двоих, вы что-нибудь да придумаете… Вот только этот человек врядли захочет болтать с теми, кто не приносит пользы. Я конечно расскажу про тебя всё, но на всякий случай, принеси чего, что может это подтвердить, лады? Незнаю, букет Снежноцвета, к примеру…`',
        'type' : 'item',
        'item' : 'snowflower',
        'need' : 3
    }, 'start_15': {
        'text' : '`-Эй, ты!  Да-да, я к тебе обращаюсь! Подойди сюда. Можешь обращаться ко мне Офицер Эрнест. Я наслышан о вас от нашего общего друга. Он сообщил мне, я могу на вас полагаться в некоторых вопросах. И я хотел бы предоставить вам официальный запрос. Нам интересен способ, которым Каменные Гиганты из гор поддерживают свою жизнь, так что мы хотели бы получить то, что является… Я полагаю, головой этого монстра.`',
        'type' : 'monster',
        'monster' : 'stonegiant',
        'need' : 1
    }, 'start_16': {
        'text' : '`-Благодарю за помощь. Корпус инженеров уже занимается вашей находкой, однако у нас возникла проблема. Корованы снабжения, которые были отправлены через Лес, должны были прийти еще несколько дней назад. Мы подозреваем, что они могли попасть в ловушки разбойников “Робина Хорошего”, но сейчас армия не в состоянии отправить поисковый отряд. Если вы найдёте какие-нибудь следы, дайте знать.`',
        'type' : 'item',
        'item' : 'lost_cargo',
        'need' : 5
    }, 'start_17': {
        'text' : '`-То, что вы нашли только груз… Волнует. Кто бы это ни был, почему они не забрали его? Хотя, если это разбойники, этот груз может быть им бесполезен... Ладно. Мне нужно доставить груз к месту назначения. Спасибо за вашу помощь, надеюсь мы еще встретимся, и удачи. Удача скоро всем нам понадобится…`',
        'type' : 'adventure',
        'adventure' : 'tavern',
        'need' : 1
    }, 'start_18': {
        'text' : '`Ведите себя неподозрительно. Не привлекайте внимание. Я представитель организации, известной как Старая Гильдия. Мы знаем о ситуации, и хотим помочь… Своими способами. Но чтобы не привлекать внимания, мы надеемся на вашу помощь, чтобы раздобыть необходимые… Ресурсы. Надеюсь на вас. `',
        'type' : 'item',
        'item' : 'hallucberri',
        'need' : 10
    }, 'start_19': {
        'text' : '`Хо, какие люди! Давно ты лично ко мне за заданиями не подходил. Эрнест нагрузил, да? Думаю, вы прекрасно сработались. Но раз уж ты освободился, не подсобишь? Я много не прошу, просто опять некому за хворостом сходить…`',
        'type' : 'item',
        'item' : 'stick',
        'need' : 25
    }, 'start_20': {
        'text' : '`-С-спассибо за вашу помощь… Благодаря вам, вссе наши приготовления завершены. О, не волнуйтесь, Старая Гильдия вас не забудет… Но вам лучше покинуть гор на несколько дней… Из соображений безопассности. Говорят, что в горах есть заброшенные шахты… Почему бы вам не проверить слухи?`',
        'type' : 'item',
        'item' : 'iron',
        'need' : 10
    }, 'start_21': {
        'text' : '`-Тёмные времена настают, вот что я тебе скажу! А, ты же не вкурсе! Вся таверна – да что таить, весь город как на иголках. Какие-то люди захватили власть в городе, и обьявили, что дословно ‘Старая Гильдия разберётся с войной’. Но уж я-то говорю – никто о них ничего не слышал уже лет пять так точно, а до этого были одни слухи, что последняя из Гильдий, которые королевство разрушило из-за коррумпированности и их увеличивающейся власти, ушла в подполье. Ох не к добру это… Но жизнь продолжается, не так ли? Говоришь, в горах есть шахты с углём? Ты не против принести мне немного,  на растопку? Всяко лучше хвороста…`',
        'type' : 'item',
        'item' : 'coal',
        'need' : 15
    }, 'start_22': {
        'text': '`Пс, слушай… Слушай, у меня есть идея. Эта Старая Гильдия... Как говорится, клин вышибают клином. Они сейчас у власти – но не надолго, если у них появятся противники. Нужно организовать людей, собрать силу. Все Гильдии были по сути уничтожены королевством… Но не думаю что они будут против в ЭТОМ случае. `',
        'type': 'adventure',
        'adventure': 'guild',
        'need' : 1
    }, 'start_23': {
        'text': '`-Из гор вернулись исследователи. Все потрёпанные, говорят, встретили в горах какую-то Логику. Монстр что ли какой? Если так, то редкий до жути, никогда о нём не слышал! Не хочешь сходить, разузнать всё?`',
        'type': 'item',
        'item': 'logic',
        'need' : 1
    }, 'start_24': {
        'text': '`-Вот это было народное слово! Кто бы мог подумать! Столько Гильдий! И все – объединились против власти! Ох, моё старое сердце так и стучит! У меня слов нет чтобы описать всё это! Как вы это провернули! Я же надеюсь, ты не забудешь моя маленькую таверну, а? Здесь много слухов проходит, и много информации, да! Например, тут кто-то поговаривал что в горах нашли путь на восток. Новые земли, говорят.`',
        'type': 'adventure',
        'adventure' : 'mount',
        'need' : 1
    }
}